app/views/plants/index.html.slim

SELECT "genus".* FROM "genus"
---
            br
            = select_tag :genu_id, options_from_collection_for_select(Genu.all, :id, :name, params[:genu_id]), :prompt => 'Все'

SELECT "plants".* FROM "plants" WHERE "plants"."genu_id" = 1 AND "plants"."plant_id" IS NULL
---
        ul
          - genu.plants.only_parents.each do |kind|