app/views/control/users/_form.html.slim

      .controls
        = f.select :role_id, Role.all.map { |r| [r.title, r.id] }
---
SELECT "roles".* FROM "roles"