app/views/control/members/_address.html.erb

          <div class="controls">
            <%= f.select :member_address_type_id,
                         options_from_collection_for_select(MemberAddressType.all, 'id', 'name', f.object.member_address_type_id) %>
---
SELECT "member_address_types".* FROM "member_address_types"
SELECT "member_addresses".* FROM "member_addresses" WHERE "member_addresses"."member_id" = 7