app/views/control/plants/_form.html.slim

SELECT "genus".* FROM "genus" WHERE "genus"."id" = 1 LIMIT 1
---
        = f.hidden_field :genu_id
        = text_field_tag :id => "genu", :autocomplete => "off", :placeholder => "Введите название", :value => @plant.genu.name if @plant.genu.present?
    .control-group