app/views/control/plants/index.html.slim

        td
          = select_tag :genu_id, options_from_collection_for_select(Genu.all, :id, :name, params[:genu_id]), :prompt => 'Все'
---
SELECT "genus".* FROM "genus"