app/views/control/regions/_form.html.slim

      .controls
        = f.select :country_id, options_from_collection_for_select(Country.all, :id, :name, @region.country_id)
    .control-group
---
SELECT "countries".* FROM "countries"