app/controllers/images_controller.rb

SELECT "images".* FROM "images" WHERE "images"."owner_id" = 0
---
  def index

    @images = Image.where(:owner_id => params[:owner_id])

INSERT INTO "images" ("created_at", "owner_id", "picture_content_type", "picture_file_name", "picture_file_size", "picture_updated_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create

    image_hash = { :picture => params[:image] }
    @image = Image.new(image_hash)
    @image.user_id = current_user.id

    respond_to do |format|
      if @image.save