app/controllers/plants_controller.rb

  def index

    respond_to do |format|
      format.html {

        @genus = Genu.order

        unless params[:genu_id].blank?
          @genus = @genus.where(:id => params[:genu_id])
        end

        unless params[:search].blank?
          search_string = "%#{params[:search]}%"
          @genus = @genus.joins(:plants)
          .where('genus.name LIKE ? OR genus.lat_name LIKE ? OR plants.name LIKE ? OR plants.lat_name LIKE ?',
                 search_string, search_string, search_string, search_string)
          .group('genus.id')
        end

        @genus = @genus.paginate(:page => params[:page])
---
SELECT "genus".* FROM "genus"
SELECT "genus".* FROM "genus" INNER JOIN "plants" ON "plants"."genu_id" = "genus"."id" WHERE "genus"."id" = 1 AND (genus.name LIKE '%dinamic routes%' OR genus.lat_name LIKE '%dinamic routes%' OR plants.name LIKE '%dinamic routes%' OR plants.lat_name LIKE '%dinamic routes%') GROUP BY genus.id LIMIT 30 OFFSET 0
SELECT "plants".* FROM "plants" WHERE "plants"."genu_id" = 1 AND "plants"."plant_id" IS NULL
SELECT COUNT(*) AS count_all, genus.id AS genus_id FROM "genus" INNER JOIN "plants" ON "plants"."genu_id" = "genus"."id" WHERE "genus"."id" = 1 AND (genus.name LIKE '%dinamic routes%' OR genus.lat_name LIKE '%dinamic routes%' OR plants.name LIKE '%dinamic routes%' OR plants.lat_name LIKE '%dinamic routes%') GROUP BY genus.id

  def show
    @plant = Plant.find(params[:id])
---
SELECT "plants".* FROM "plants" WHERE "plants"."id" = ? LIMIT 1  [["id", "4"]]