app/controllers/profile_controller.rb

UPDATE "users" SET "name" = 'Игорь', "last_name" = 'Трофимов', "surname" = 'Александрович', "address" = 'г.Хабаровск ул. Тихоокеанская 201 61', "phone" = '+7-914-196-15-79', "skype" = 'trofimov_igor1', "icq" = '', "site" = 'www.plushki.com', "updated_at" = '2013-05-07 02:57:39.059416' WHERE "users"."id" = 14
---
  def update_me
    @user = current_user

    if params[:user][:password].blank? && params[:user][:password_confirmation].blank?
      params[:user].delete(:password)
      params[:user].delete(:password_confirmation)
    end

    if @user.update_attributes(params[:user])

INSERT INTO "members" ("contacts", "country_id", "created_at", "description", "email", "image_id", "is_moderated", "member_tariff_id", "name", "phone", "site", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def update_member
    if current_user.member.nil?
      @member = Member.new(params[:member])
      result = @member.save

SELECT "member_prices".* FROM "member_prices" WHERE "member_prices"."id" = ? LIMIT 1  [["id", "1"]]
---
  def catalog
    redirect_to profile_member_path and return if current_user.member.nil?
    @member = current_user.member

    if params[:member_price_id]
      @member_price = MemberPrice.find(params[:member_price_id])

INSERT INTO "member_prices" ("created_at", "member_id", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Tue, 07 May 2013 03:08:01 UTC +00:00], ["member_id", 7], ["name", "Еще один прайс"], ["updated_at", Tue, 07 May 2013 03:08:01 UTC +00:00]]
---
  def save_price
    @price = MemberPrice.new(params[:member_price])
    @price.member_id = current_user.member.id
    @price.save

INSERT INTO "plant_prices" ("count", "created_at", "member_id", "note", "packing", "plant_id", "price", "size", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "plant_prices".* FROM "plant_prices" WHERE "plant_prices"."id" = ? LIMIT 1  [["id", "3"]]
SELECT "member_prices".* FROM "member_prices" WHERE "member_prices"."id" = ? LIMIT 1  [["id", "1"]]
---
  def update_plant_price

    if params[:plant_price]
      plant_price = PlantPrice.new(params[:plant_price])
      plant_price.member_id = current_user.member.id
      if plant_price.save
        render :json => {:status => 'ok', :plant_price_id => plant_price.id}
      else
        render :json => {:status => 'error', :errors => plant_price.errors}
      end
    else
      if params[:plant_price_id] and params[:member_price_id]

        @plant_price = PlantPrice.find(params[:plant_price_id])

        @member_price = @plant_price.member_prices.where(:id => params[:member_price_id]).first

SELECT "plant_prices".* FROM "plant_prices" WHERE "plant_prices"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "plant_prices" WHERE "plant_prices"."id" = ?  [["id", 1]]
---
  def remove_plant_price
    @plant_price = PlantPrice.find(params[:plant_price_id])
    @plant_price.destroy