app/views/profile/_plant_price.html.slim

  select.price-select.multiselect multiple="multiple"
    - current_user.member.member_prices.each do |member_price|
---
SELECT "member_prices".* FROM "member_prices" WHERE "member_prices"."member_id" = 1