app/views/profile/_plant_price.html.erb

<td class="plant-name">
  <%= @plant_price.plant.name if @plant_price.plant.present? %>
---
SELECT "plants".* FROM "plants" WHERE "plants"."id" = 2 LIMIT 1

  <select class="price-select multiselect" multiple="multiple">
    <% current_user.member.member_prices.each do |member_price| %>
---
SELECT "member_prices".* FROM "member_prices" WHERE "member_prices"."member_id" = 7