app/views/profile/member.html.slim

        .controls
          = f.select :member_tariff_id, options_from_collection_for_select(MemberTariff.all, 'id', 'name', @member.member_tariff_id)
      .control-group
---
SELECT "member_tariffs".* FROM "member_tariffs"

        .controls
          = f.select :country_id, options_from_collection_for_select(Country.all, :id, :name, @member.country_id)
      .control-group
---
SELECT "countries".* FROM "countries"

      #categories
        - for category in MemberCategory.all
          .category
            = check_box_tag "member[member_category_ids][]", category.id, @member.member_categories.include?(category)
---
SELECT "member_categories".* FROM "member_categories"
SELECT 1 AS one FROM "member_categories" INNER JOIN "member_categories_members" ON "member_categories"."id" = "member_categories_members"."member_category_id" WHERE "member_categories_members"."member_id" = 1 AND "member_categories"."id" = 1 LIMIT 1

        .list
          - if @member.regions.count > 0
---
SELECT COUNT(*) FROM "regions" INNER JOIN "members_regions" ON "regions"."id" = "members_regions"."region_id" WHERE "members_regions"."member_id" = 1