app/controllers/control/countries_controller.rb

SELECT "countries".* FROM "countries" ORDER BY created_at desc LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "countries"
---
    def index
      @countries = Country.order("#{sort_column} #{sort_direction}").paginate(:page => params[:page])