app/controllers/control/genus_controller.rb

    def index

      @genus = Genu.order("#{sort_column} #{sort_direction}")
      if params[:category_id]
        @genus = @genus.where(:plant_category_id => params[:category_id])
      end
      @genus = @genus.paginate(:page => params[:page])
---
SELECT "genus".* FROM "genus" ORDER BY created_at desc LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "genus"