app/controllers/control/member_categories_controller.rb

    def index
      @member_categories = MemberCategory.order("#{sort_column} #{sort_direction}")
---
SELECT "member_categories".* FROM "member_categories" ORDER BY created_at desc

    def create
      @member_category = MemberCategory.new(params[:member_category])

      respond_to do |format|
        if @member_category.save
---
INSERT INTO "member_categories" ("created_at", "description", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Tue, 28 May 2013 03:42:15 UTC +00:00], ["description", "Покупаем рассаду"], ["name", "Братство огородников"], ["updated_at", Tue, 28 May 2013 03:42:15 UTC +00:00]]