app/controllers/control/members_controller.rb

    def index
      @members = Member.order("#{sort_column} #{sort_direction}").paginate(:page => params[:page])
---
SELECT "members".* FROM "members" ORDER BY created_at desc LIMIT 30 OFFSET 0

    def create

      @member = Member.new(params[:member])

      respond_to do |format|
        if @member.save
---
INSERT INTO "members" ("contacts", "country_id", "created_at", "description", "email", "image_id", "is_moderated", "member_tariff_id", "name", "phone", "site", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)