app/controllers/control/plant_features_controller.rb

SELECT "plant_features".* FROM "plant_features" ORDER BY created_at desc
---
    def index
      @plant_features = PlantFeature.order("#{sort_column} #{sort_direction}")

INSERT INTO "plant_features" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Tue, 28 May 2013 03:46:31 UTC +00:00], ["name", "Теплолюбивое"], ["updated_at", Tue, 28 May 2013 03:46:31 UTC +00:00]]
---
    def create
      @plant_feature = PlantFeature.new(params[:plant_feature])

      respond_to do |format|
        if @plant_feature.save