app/controllers/control/plants_controller.rb

    def index

      @plants = Plant.order("#{sort_column} #{sort_direction}")
      unless params[:name].blank?
        name_query = "%#{params[:name]}%"
        @plants = @plants.where('name LIKE ? OR lat_name LIKE ?', name_query, name_query)
      end
      unless params[:genu_id].blank?
        @plants = @plants.only_parents.where(:genu_id => params[:genu_id])
      end
      unless params[:plant_category_id].blank?
        @plants = @plants.where(:plant_category_id => params[:plant_category_id])
      end
      @plants = @plants.paginate(:page => params[:page])
---
SELECT "plants".* FROM "plants" ORDER BY created_at desc LIMIT 30 OFFSET 0

    def create
      @plant = Plant.new(params[:plant])

      respond_to do |format|
        if @plant.save
---
INSERT INTO "plants" ("application", "created_at", "crown", "description", "description_short", "enabled", "flowers", "genu_id", "height", "lat_name", "lat_synonyms", "leaves", "name", "plant_category_id", "plant_id", "synonyms", "updated_at", "width") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)