app/controllers/control/plant_categories_controller.rb

SELECT "plant_categories".* FROM "plant_categories" WHERE "plant_categories"."plant_category_id" IS NULL ORDER BY created_at desc
SELECT "plant_categories".* FROM "plant_categories" WHERE "plant_categories"."parent_category_id" IS NULL ORDER BY created_at desc
---
    def index

      case params[:filter]
        when 'category' then

          @plant_categories = []

          category = PlantCategory.find(params[:id])
          @plant_categories << category
          until category.plant_category_id.nil?
            category = PlantCategory.find(category.plant_category_id)
            @plant_categories << category
          end
          @plant_categories.reverse!

        when 'parent' then
          @plant_categories = PlantCategory.where(:parent_category_id => params[:id])

SELECT "plant_categories".* FROM "plant_categories" WHERE "plant_categories"."id" = ? LIMIT 1  [["id", "6"]]
---
    def edit
      @plant_category = PlantCategory.find(params[:id])

INSERT INTO "plant_categories" ("created_at", "description", "lat_name", "name", "parent_category_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
    def create
      @plant_category = PlantCategory.new(params[:plant_category])

      respond_to do |format|
        if @plant_category.save