app/controllers/control/regions_controller.rb

    def index

      @regions = Region.order("#{sort_column} #{sort_direction}")
      if params[:country_id]
        @regions = @regions.where(:country_id => params[:country_id])
      end
      @regions = @regions.paginate(:page => params[:page])
---
SELECT "regions".* FROM "regions" WHERE "regions"."country_id" = 9 ORDER BY created_at desc LIMIT 30 OFFSET 0

    def create
      @region = Region.new(params[:region])

      respond_to do |format|
        if @region.save
---
INSERT INTO "regions" ("country_id", "created_at", "name", "updated_at") VALUES (?, ?, ?, ?)  [["country_id", 1], ["created_at", Tue, 28 May 2013 03:44:41 UTC +00:00], ["name", "автокомплит будем делать"], ["updated_at", Tue, 28 May 2013 03:44:41 UTC +00:00]]