app/controllers/control/users_controller.rb

    def index
      @users = User.order("#{sort_column} #{sort_direction}").paginate(:page => params[:page])
---
SELECT "users".* FROM "users" ORDER BY created_at desc LIMIT 30 OFFSET 0

    def update
      @user = User.find(params[:id])

      if params[:user][:password].blank? && params[:user][:password_confirmation].blank?
        params[:user].delete(:password)
        params[:user].delete(:password_confirmation)
      end

      respond_to do |format|
        if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
UPDATE "users" SET "name" = 'Игорь', "last_name" = 'Тро', "surname" = 'Але', "address" = 'Тихоокеанская 201 61', "phone" = '79141961578', "skype" = 'trofimov_igor1', "icq" = '', "site" = 'www.plushki.com', "updated_at" = '2013-05-28 03:45:41.807511' WHERE "users"."id" = 1