app/views/members/index.html.erb

            <p>
              <%= select_tag :country_id,
                             options_from_collection_for_select(Country.all, :id, :name, params[:country_id]),
                             :prompt => 'Все',
                             :onchange => 'loadRegions(this, "#region_id")' %>
---
SELECT "countries".* FROM "countries"

              <strong>Адреса:</strong>
              <% member.member_addresses.each do |address| %>
---
SELECT "member_addresses".* FROM "member_addresses" WHERE "member_addresses"."member_id" = 1