app/views/members/show.html.slim

SELECT "regions".* FROM "regions" INNER JOIN "members_regions" ON "regions"."id" = "members_regions"."region_id" WHERE "members_regions"."member_id" = 2
---
    dd
      - @member.regions.each do |region|